In [3]:
import mysql.connector

# Create batabase

# Create Table

In [5]:
conn = mysql.connector.connect(
    host = "localhost",
    user = "root",
    password = "1234",
    database = "curddatabase"
)
db = conn.cursor()
name = "student"
query = f"SHOW TABLES LIKE '{name}'"
db.execute(query)
fach = db.fetchone()

if fach:
    print("all reade create table",fach)
else:
   query = f"""create table '{name}' (
      id int auto_increment,
      name varchar(10) not null,
      age int not null,
      mark int not null,
      class varchar(100),
      primary key(id)
   )"""
   db.execute(query)
   print("Success fully Create table")
conn.commit()

all reade create table ('student',)

# Data insert in Mysql table

In [ ]:
query = "insert into student (name,age,mark,class) values(%s,%s,%s,%s)"
values = ("noor",23,85,"5th")
db.execute(query,values)
print("Data insert Success fully")
query2 = "select * from student"
db.execute(query2)
data = db.fetchall()
for i in data:
    print(i)
conn.commit()

# Multiple data insert in mysql table

In [29]:
query = "insert into student (name,age,mark,class) values(%s,%s,%s,%s)"
values = [
    ("Amit", 21, 90, "BCA"),
    ("Sita", 22, 88, "MCA"),
    ("Ravi", 24, 75, "BBA"),
    ("radha", 25, 86, "MBA")
]
db.executemany(query,values)
query2 = "select * from student"
db.execute(query2)
data = db.fetchall()
for i in data:
    print(i)
conn.commit()

(3, 'noor', 23, 85, '5th')
(4, 'noor', 23, 85, '5th')
(5, 'Amit', 21, 90, 'BCA')
(6, 'Sita', 22, 88, 'MCA')
(7, 'Ravi', 24, 75, 'BBA')
(8, 'radha', 25, 86, 'MBA')
(9, 'Amit', 21, 90, 'BCA')
(10, 'Sita', 22, 88, 'MCA')
(11, 'Ravi', 24, 75, 'BBA')
(12, 'radha', 25, 86, 'MBA')
(13, 'Amit', 21, 90, 'BCA')
(14, 'Sita', 22, 88, 'MCA')
(15, 'Ravi', 24, 75, 'BBA')
(16, 'radha', 25, 86, 'MBA')

# One row recode Update in mysql

In [6]:
query = "update student set name = %s, age = %s where id=3"
values = ("noor khan", 28)
db.execute(query,values)
print("Update success fully data")

query2 = "select * from student"
db.execute(query2)
data = db.fetchall()
for i in data:
    print(i)
conn.consume_results() 
conn.commit()

Update success fully data
(3, 'noor khan', 28, 85, '5th')
(4, 'rabi', 23, 85, '5th')
(5, 'Amit', 55, 90, 'BCA')
(6, 'Sita', 50, 78, 'MCA')
(7, 'Ravi b', 50, 75, 'BBA')
(8, 'radha', 25, 90, 'MBA')
(9, 'Amit', 21, 90, 'BCA')
(10, 'Sita', 22, 88, 'MCA')
(11, 'Ravi', 24, 75, 'BBA')
(12, 'radha', 25, 86, 'MBA')
(13, 'Amit', 21, 90, 'BCA')
(14, 'Sita', 22, 88, 'MCA')
(15, 'Ravi', 24, 75, 'BBA')
(16, 'radha', 25, 86, 'MBA')

# Multiple recode Update in mysql

In [11]:
query = "update student set name = %s, age = %s, mark = %s where id = %s"
values = [
    ('rabi', 23, 85, 4),
    ('Amit', 55, 90, 5),
    ('Sita', 50, 78, 6),
    ('Ravi', 50, 75, 7),
    ('radha', 25, 90, 8)
]
db.executemany(query,values)
print("Success fully update data")

query2 = "select * from student"
db.execute(query2)
result = db.fetchall()
for i in result:
    print(i)
conn.consume_results() 
conn.commit()

Success fully update data
(3, 'noor khan', 28, 85, '5th')
(4, 'rabi', 23, 85, '5th')
(5, 'Amit', 55, 90, 'BCA')
(6, 'Sita', 50, 78, 'MCA')
(7, 'Ravi', 50, 75, 'BBA')
(8, 'radha', 25, 90, 'MBA')
(9, 'Amit', 21, 90, 'BCA')
(10, 'Sita', 22, 88, 'MCA')
(11, 'Ravi', 24, 75, 'BBA')
(12, 'radha', 25, 86, 'MBA')
(13, 'Amit', 21, 90, 'BCA')
(14, 'Sita', 22, 88, 'MCA')
(15, 'Ravi', 24, 75, 'BBA')
(16, 'radha', 25, 86, 'MBA')

# User one recode delete in mysql table

In [13]:
query = "delete from student where id = %s"
values = (3,)
db.execute(query,values)
print("Success fully Delete mysql table row")

query2 = "select * from student"
db.execute(query2)
result = db.fetchall()
for i in result:
    print(i)

Success fully Delete mysql table row
(4, 'rabi', 23, 85, '5th')
(5, 'Amit', 55, 90, 'BCA')
(6, 'Sita', 50, 78, 'MCA')
(7, 'Ravi', 50, 75, 'BBA')
(8, 'radha', 25, 90, 'MBA')
(9, 'Amit', 21, 90, 'BCA')
(10, 'Sita', 22, 88, 'MCA')
(11, 'Ravi', 24, 75, 'BBA')
(12, 'radha', 25, 86, 'MBA')
(13, 'Amit', 21, 90, 'BCA')
(14, 'Sita', 22, 88, 'MCA')
(15, 'Ravi', 24, 75, 'BBA')
(16, 'radha', 25, 86, 'MBA')